app/controllers/listings_controller.rb

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
UPDATE "listings" SET "verified" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["verified", 0], ["updated_at", "2018-06-12 02:27:25.189542"], ["id", 21]]
---
	def verified
		@listing = Listing.find(params[:id])
		@listing.update(verified: 0)

SELECT  "listings".* FROM "listings" ORDER BY "listings"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "listings" ORDER BY "listings"."name" ASC LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 15], ["OFFSET", 0]]
---
	def index
		@listing = Listing.all.order(:name).page(params[:page])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def require_superadmin
		unless current_user == Listing.find(params[:id]).user || current_user.superadmin?

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
	def require_moderator
	 	unless current_user == Listing.find(params[:id]).user || current_user.moderator?

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
	def require_customer
	 	unless current_user == Listing.find(params[:id]).user || current_user.customer?