app/controllers/listings_controller.rb

	def index
		@listing = Listing.all
---
SELECT "listings".* FROM "listings"